Documents/ПриобретениеАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриобретениеАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенег</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиВалюты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаЕдиницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенег</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиВалюты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАктивов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОборотыАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыАктивов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИзменениеКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменениеСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсКРублю</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипОперацииАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипОперацииАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипОперацииАктивов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пополнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Активы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Активы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипАктива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПриобретениеАктива/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1. Проверки
	Если НЕ ЗначениеЗаполнено(Актив) Тогда
		Сообщить("Ошибка: Не выбран актив!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Количество <= 0 Тогда
		Сообщить("Ошибка: Количество должно быть больше 0!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// 2. Получаем данные об активе и его курс
	ЗапросДанные = Новый Запрос;
	ЗапросДанные.Текст = 
	"ВЫБРАТЬ

	|	Активы.Валюта КАК ВалютаАктива,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс
	|ИЗ

	|	Справочник.Активы КАК Активы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	|		ПО Активы.Валюта = КурсыВалютСрезПоследних.Валюта

	|ГДЕ
	|	Активы.Ссылка = &Актив";
	
	ЗапросДанные.УстановитьПараметр("Актив", Актив);
	ЗапросДанные.УстановитьПараметр("Дата", МоментВремени()); 
	
	Выборка = ЗапросДанные.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ВалютаАктива = Выборка.ВалютаАктива;
	
	КодВалюты = СокрЛП(Валюта.Код);
	ТекущийОстаток = 0;

	ЗапросОстатки = Новый Запрос;
	Если КодВалюты = "RUB" Тогда
		ЗапросОстатки.Текст = 
		"ВЫБРАТЬ

		|	СУММА(Остатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.Остатки(&МоментВремени, Пользователь = &Пользователь) КАК Остатки";
	Иначе
		ЗапросОстатки.Текст = 
		"ВЫБРАТЬ

		|	СУММА(Остатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиВалюты.Остатки(&МоментВремени, Пользователь = &Пользователь И Валюта = &Валюта) КАК Остатки";
		ЗапросОстатки.УстановитьПараметр("Валюта", Валюта);
	КонецЕсли;

	ЗапросОстатки.УстановитьПараметр("МоментВремени", МоментВремени());
	ЗапросОстатки.УстановитьПараметр("Пользователь", Пользователь);

	ВыборкаОстатки = ЗапросОстатки.Выполнить().Выбрать();
	Если ВыборкаОстатки.Следующий() Тогда
		// Исправлено: заменяем ЕСТЬNULL на проверку значения
		ТекущийОстаток = ?(ВыборкаОстатки.СуммаОстаток = Неопределено, 0, ВыборкаОстатки.СуммаОстаток);
	КонецЕсли;

	// Если денег меньше, чем сумма в документе — отменяем проведение
	Если ТекущийОстаток < Сумма Тогда
		Сообщить("Недостаточно средств для покупки! Требуется: " + Сумма + " " + Валюта + ", в наличии: " + ТекущийОстаток);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// 3. Расчет суммы в валюте актива
	СуммаВВалютеАктива = Сумма;
	Если Валюта <> ВалютаАктива Тогда
		СуммаВВалютеАктива = ?(Выборка.Курс <> 0, Сумма / Выборка.Курс, Сумма);
	КонецЕсли;

	// 4. Движения: ОстаткиАктивов
	Движения.ОстаткиАктивов.Записывать = Истина;
	Движение = Движения.ОстаткиАктивов.ДобавитьПриход();
	Движение.Период           = Дата;
	Движение.Актив            = Актив;
	Движение.Пользователь      = Пользователь;
	Движение.Количество       = Количество;
	Движение.СуммаВложений    = СуммаВВалютеАктива; // Ресурс по вашей структуре
	Движение.ТекущаяСтоимость = СуммаВВалютеАктива; // Ресурс по вашей структуре

	// 5. Движения: ОборотыАктивов
	Движения.ОборотыАктивов.Записывать = Истина;
	Движение = Движения.ОборотыАктивов.Добавить();
	Движение.Период             = Дата;
	Движение.Актив              = Актив;
	Движение.Пользователь        = Пользователь;
	Движение.ТипОперации        = Перечисления.ТипОперацииАктивов.Пополнение;
	Движение.ИзменениеКоличества = Количество;
	Движение.ИзменениеСуммы      = СуммаВВалютеАктива;
	Движение.КурсКРублю         = Выборка.Курс; // Ресурс по вашей структуре

	// 6. Движения по деньгам (остатки)
	КодВалюты = СокрЛП(Валюта.Код); 
	
	Если КодВалюты = "RUB" Тогда
        // Оплата в рублях
        Движения.ОстаткиДенег.Записывать = Истина;
        Движение = Движения.ОстаткиДенег.ДобавитьРасход();
        Движение.Период       = Дата;
        Движение.Пользователь  = Пользователь;
        Движение.Сумма        = Сумма;
    Иначе
        // Оплата в любой другой валюте (USD, EUR и т.д.)
        // Теперь движение будет всегда, если это не рубль
        Движения.ОстаткиВалюты.Записывать = Истина;
        Движение = Движения.ОстаткиВалюты.ДобавитьРасход();
        Движение.Период       = Дата;
        Движение.Пользователь  = Пользователь;
        Движение.Валюта       = Валюта;
        Движение.Сумма        = Сумма;
   КонецЕсли;
   
КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
           Если ПустаяСтрока(Номер) Тогда   
        // Считаем количество существующих документов
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    КОЛИЧЕСТВО(Документы.Ссылка) КАК Количество
        |ИЗ
        |    Документ.ПриобретениеАктива КАК Документы";
        
        Результат = Запрос.Выполнить();
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        
        СледующийНомер = Выборка.Количество + 1;
        
             Префикс = "ПА-";
        Год = Формат(Дата, "ДФ=yyyy");
        Номер = Префикс + Год + "-" + Формат(СледующийНомер, "ЧЦ=6; ЧВН=");
        
       КонецЕсли;
    
КонецПроцедуры
